package itaital100.gmail.com.terutson;

public class ExcusesData
{

    /*
    Rules for writing excuses:
        1) dont make it over complicated.
        2) dont make it too long
        3) dont make it too detailed. its okay to "leave  things at  the dark"
     */
//##################################################################################################
    //@@@@@@@@@@@@                      Meeting:                 @@@@@@@@@@@@@@@@//

    //Hebrew - Male :
    public static String[] Exuces_meeting =
            {
                    "יש לי תור לרופא",
                    "היי, קמתי עם חום היום",
                    "משהוא דחוף שמצריך אותי צץ עכשיו ואני לא אוכל לבוא",
                    "יש לאח שלי יום הולדת ואנחנו חוגגים לו במסעדה",
                    "יש אזכרה לסבתא רבא שלי ולגמרי שכחתי מזה",
                    "יש לי מיגרנה ואני לא רוצה להיפגש כשאני ככה",
                    "יש לבן הדוד שלי יום הולדת",
                    "החליפו איתי משמרת, אני אעבוד בשעות האלה",
                    "טיפה הגזמתי אתמול, אני מוכרח להשלים שעות שינה",
                    "הרכבת מתעכבת, לא אספיק להגיע בזמן",
                    "יש עומס בעבודה, אני רוצה להמשיך לעבוד מהבית",
                    "יש לנו אורחים",
                    "יש לי מבחן חשוב שאני צריך להתכונן אליו, פעם אחרת ?",
                    "אני צריך לקחת את אמא שלי לבית חולים",
                    "הילד חולה, אני רוצה להישאר איתו בבית",
                    "לא מרגיש טוב כל כך",
                    "נשברו לי המשקפיים, אני הולך לתקן אותם",
                    "כואבת לי הבטן...אני לא אוכל להיפגש ככה",
                    "פצעתי את העין כשניסיתי לשים עדשות",
                    "אני עובר טיפול שורש",
                    "יש לי שפעת",
                    "שכחתי את הדיסק און קי",
                    "שיט, שכחתי מזה לגמרי וכבר קבעתי תוכניות",
                    "אני מחכה לשליח וזה כבר הניסיון השלישי שלו לתפוס אותי",
                    "אני צריך לשמור על אחותי",
                    "אבא שלי לא מוכן להביא לי את האוטו",
                    "אני אגיד לך את האמת - לא מתחשק לי לצאת היום",
                    "יש לי דייט. לא יכול להיפגש, מצטער",
                    "צריך לאסוף חבר שהטרמפ שלו הבריז לו מהרכבת",
                    "אח שלי חולה ואני לטפל בו"
            };
    //Hebrew - Female:
    public static String[] Exuces_meeting_female =
            {
                    "Exuces_ex5",
                    "Exuces_ex6"
            };
    //english:
    public static String[] Exuces_meeting_english=
            {
                    "Exuces_ex7",
                    "Exuces_ex8"
            };
//##################################################################################################
    //@@@@@@@@@@@@                      Work:                 @@@@@@@@@@@@@@@@//

    //Hebrew - Male
    public static String[] Exuces_work =
            {
                    "התפוצץ צינור כלשהוא בבית. כל הרצפה מלאה בסמרטוטים והטכנאי יבוא רק מאוחר יותר",
                    "יש לי תור לבדיקה רפואית חשובה שלא סובלת דיחוי",
                    "אני מצטער, יש לנו מקרה חירום משפחתי. אני מקווה שהכל יהיה בסדר בקרוב ושנגלה שזו בהלת שווא",
                    "יש לי שפעת, זה כנראה מידבק",
                    "הילד לא מרגיש טוב, צריך לקחת אותו לרופא",
                    "לא מרגיש  כל כך טוב",
                    "אני צריך לקחת את אמא שלי לבית חולים",
                    "אני צריך לקחת את החברה שלי לבית חולים להוציא את התפרים",
                    "אני נעול בבית, לקחו לי את המפתח",
                    "עבדתי אתמול עד מאוחר אני אגיע טיפה באיחור היום",
                    "יש תאונה, אני כנראה אתעכב",
                    "הרכבת נעצרה. לא ברור עדיין למה, אני מתעכב",
                    "יש לי פגישה עם השיננית",
                    "דרסו לי את הכלב!",
                    "יש לי שלשולים קשים, אני מרותק לבית",
                    "הבייביסטר עושה לי בעיות, אני מחפש מישהוא אחר שישמור לי על הילדים",
                    "הרכב לא מתניע",
                    "אני עובר טיפול שורש",
                     "יש לי שפעת", //check this out
                    ""
            };
    //Hebrew - Female
    public static String[] Exuces_work_female =
            {
                    "Exuces_work4",
                    "Exuces_work5"
            };
    //English:
    public static String[] Exuces_work_english =
            {
                    "I may be called in for jury duty",
                    "Exuces_work6",
                    "Exuces_work7"
            };

//##################################################################################################

    //@@@@@@@@@@@@                      Ex:                 @@@@@@@@@@@@@@@@//

    //Hebrew - Male
    public static String[] Exuces_ex =
            {       "קיבלתי מכה ביד היא כואבת לי",
                    "אני אעשה את זה מאוחר יותר אני בשוונג של לימודים",
                    "יש לי מיגרנה",
                    "הבטן כואבת לי",
                    "שכחתי מזה לגמרי",
                    "בוא נצא החוצה למסעדה",
                    "היה לי יום ארוך היום",
                    "יש לי עבודה לעשות",
                    "אני הולך לישון, חייב להשלים שעות שינה",
                    "חייב לעזור לחבר במשבר",
                    "אם היית נאהב על ידך לא הייתי מתבקש לעשות את זה",
                    "הגרון שלי כואב",
                    "עבדתי קשה מידי בלילה, אני לא מסוגל לעשות כלום",
                    "שכחתי, סליחה. אני אעשה את זה מאוחר מידי. אני יודע שאמרתי את זה אתמול אבל הפעם אני באמת מתכוון לזה",
                    "תכננתי לעשות את זה אחר כך, כרגע אני מפוצץ בעבודה להגיש",
                    "אני חייב להירשם... אין זמן",
                    "המפרק כואב לי",
                    "",
                    ""
            };

    //Hebrew - Female
    public static String[] Exuces_ex_female =
            {
                    "כאבי מחזור",
                    "Exuces_ex5",
                    "Exuces_ex6",
                    "Exuces_ex7",
                    "Exuces_ex8"
            };
    //English:
    public static String[] Exuces_ex_english =
            {
                    "Exuces_ex9",
                    "Exuces_ex10",
                    "Exuces_ex11",
                    "Exuces_ex12"
            };


//##################################################################################################

    //@@@@@@@@@@@@                      Date:                 @@@@@@@@@@@@@@@@//
    public static String[] Exuces_date =
            {
                    "נשברו לי המשקפיים, אני הולך לתקן אותם",
                    "דרסו לי את הכלב!",
                    "תשמעי, אני אהיה איתך כנה. אני לא רואה את זה מתקדם לשום מקום",
                    "אני צריך לקום מוקדם מחר",
                    "שכחתי להאכיל את החתול שלי",
                    "נראלי יש לי הרעלת מזון",
                    "אני לא מוכן למערכת יחסים כרגע",
                    "יש לי שלשול",
                    "צריך לאסוף חבר שהטרמפ שלו הבריז לו מהרכבת",
                    "אני חושב שזה לא יילך בינינו, אני רוצה שנהיה רק חברים"
            };
    //Hebrew - Female
    public static String[] Exuces_date_female =
            {
                    "יש לי בחילות, קיבלתי",
                    "",
                    "Exuces_date6",
                    "Exuces_date7",
                    "Exuces_date8"
            };
    //English:
    public static String[] Exuces_date_english =
            {
                    "Exuces_date10",
                    "Exuces_date11",
                    "Exuces_date12",
                    "Exuces_date13"
            };

//##################################################################################################

    //@@@@@@@@@@@@                      Occassion:                 @@@@@@@@@@@@@@@@//
    public static String[] Exuces_occasion =
            {
                    "Exuces_occasion1",
                    "Exuces_occasion2",
                    "Exuces_occasion3",
                    "Exuces_occasion4"
            };
    //Hebrew - Female
    public static String[] Exuces_occasion_female =
            {
                    "Exuces_occasion5",
                    "Exuces_occasion6",
                    "Exuces_occasion7",
                    "Exuces_occasion8"
            };
    //English:
    public static String[] Exuces_occasion_english =
            {
                    "Exuces_occasion10",
                    "Exuces_occasion11",
                    "Exuces_occasion12",
                    "Exuces_occasion13"
            };

//##################################################################################################

    //@@@@@@@@@@@@                      Homework:                 @@@@@@@@@@@@@@@@//

    public static String[] Exuces_hw =
            {
                    "חשבתי שצריך לעשות רק עד עמוד 21",
                    "שכחתי את המחברת בבית",
                    "לא הבנתי את החומר, אפשר הסבר נוסף בהפסקה?",
                    "אני אגיד לך את האמת - שכחתי מזה",
                    "התקשרתי ל...הוא התבלבל ואמר שאין שיעורים",
                    "התנדבתי בבית אבות",
                    "עשינו יומולדת 70 לסבא שלי",
                    "הייתי חולה",
                    "הייתי אצל רופא",
                    "יש לי 2 מחברות למקצוע והבאתי את הלא נכונה",
                    "המחשב שלי נכבה והעבודה לא נשמרה",
                    "אני חושב שלא הייתי כשחילקת את השיעורי בית",
                    "המחברת שלי אצל מישהוא אחר",
                    "שכחתי את המחברת באוטו של אמא שלי ועכשיו היא במשרד",
                    "המחברת שלי נרטבה"
            };

    //Hebrew - Female
    public static String[] Exuces_hw_female =
            {
                    "יש לי כאבים בצד",
                    "hw5",
                    "hw6",
                    "hw7",
                    "hw8"
            };
    //English:
    public static String[] Exuces_hw_english =
            {
                    "hw10",
                    "hw11",
                    "hw12",
                    "hw13"
            };
}
