package itaital100.gmail.com.terutson.Excuses;

public class ExcusesData
{

    /*
    Rules for writing excuses:
        1) dont make it over complicated.
        2) dont make it too long
        3) dont make it too detailed. its okay to "leave  things at  the dark"
     */
//##################################################################################################
    //@@@@@@@@@@@@                      Meeting:                 @@@@@@@@@@@@@@@@//

    //Hebrew - Male :
    public static String[] Exuces_meeting =
            {
                    "יש לי תור לרופא",
                    "היי, קמתי עם חום היום",
                    "משהוא דחוף צץ עכשיו ואני לא אוכל לבוא",
                    "יש לאח שלי יום הולדת ואנחנו חוגגים לו במסעדה",
                    "יש אזכרה לסבתא רבא שלי ולגמרי שכחתי מזה",
                    "יש לי מיגרנה הראש שלי מתפוצץ",
                    "יש לבן הדוד שלי יום הולדת",
                    "החליפו איתי משמרת, אני אעבוד בשעות האלה",
                    "טיפה הגזמתי אתמול, אני מוכרח להשלים שעות שינה",
                    "הרכבת מתעכבת, לא אספיק להגיע בזמן",
                    "יש מקרה חירום בעבודה, אני רוצה להמשיך לעבוד מהבית",
                    "יש לנו אורחים לא נעים לי לעזוב",
                    "יש לי מבחן חשוב שאני צריך להתכונן אליו, פעם אחרת?",
                    "אני צריך לקחת את אמא שלי לבית חולים",
                    "הילד חולה, אני נשאר איתו בבית",
                    "לא מרגיש כל כך טוב",
                    "נשברו לי המשקפיים, אני הולך לתקן אותם",
                    "כואבת לי הבטן",
                    "פצעתי את העין כשניסיתי לשים עדשות",
                    "אני עובר טיפול שורש",
                    "יש לי שפעת",
                    "שכחתי את הדיסק און קי בלימודים",
                    "שיט, שכחתי מזה לגמרי וכבר קבעתי תוכניות",
                    "אני מחכה לשליח וזה כבר הניסיון השלישי שלו לתפוס אותי",
                    "אני צריך לשמור על אחותי",
                    "אבא שלי לא מוכן להביא לי את האוטו",
                    "אני אגיד לך את האמת - לא מתחשק לי לצאת היום",
                    "יש לי דייט. לא יכול להיפגש, מצטער",
                    "צריך לאסוף חבר שהטרמפ שלו הבריז לו מהרכבת",
                    "אח שלי חולה ואני צריך לטפל בו",
                    "הכלב אכל לי את מערכת ההשקיה ואם אני לא אטפל בזה הגינה תהיה מוצפת",
                    "אני בדיוק בסיטואציה משפחתית",
                    "אתה צריך לקחת בחשבון שהיום הזה נורא לחוץ לי",
                    "אני צריך ללכת למשרד הפנים ואני כנראה לא אספיק",
                    "יש לי ישיבה באותו יום",
                    "יש לי את הילדים על הראש",
                    "אני קצת לחוץ בכסף עכשיו",
                    "זה מאוחר לי מידי אני צריך לקום מוקדם",
                    "אני צריך קודם לדבר עם...",
                    "הילד שיגע אותי וכל הלילה לא הפסיק לבכות, לא ישנתי דקה",
                    "יש פה משהו דחוף שאני חייב לעשות",
                    "עוד לא התאוששתי",
                    "הבטחתי שאני אשאר לעזור",
                    "האוטו לא מניע",
                    "צריך לסיים את הבדיקות",
                    "נראה לי שחטפתי איזה וירוס",
                    "יש לי פה קרייסיס כרגע עם המחשב ואני חייב לטפל בו דחוף"
            };
    //Hebrew - Female:
    public static String[] Exuces_meeting_female =
            {
                    "Exuces_ex5",
                    "Exuces_ex6"
            };
    //english:
    public static String[] Exuces_meeting_english=
            {
                    "Exuces_ex7",
                    "Exuces_ex8"
            };
//##################################################################################################
    //@@@@@@@@@@@@                      Work:                 @@@@@@@@@@@@@@@@//

    //Hebrew - Male
    public static String[] Exuces_work =
            {
                    "התפוצץ צינור כלשהוא בבית. כל הרצפה מלאה בסמרטוטים והטכנאי יבוא רק מאוחר יותר",
                    "יש לי תור לבדיקה רפואית חשובה שלא סובלת דיחוי",
                    "אני מצטער, יש לנו מקרה חירום משפחתי. אני מקווה שהכל יהיה בסדר בקרוב ושנגלה שזו בהלת שווא",
                    "יש לי שפעת, זה כנראה מידבק",
                    "הילד לא מרגיש טוב, צריך לקחת אותו לרופא",
                    "לא מרגיש  כל כך טוב",
                    "אני צריך לקחת את אמא שלי לבית חולים",
                    "אני צריך לקחת את החברה שלי לבית חולים להוציא את התפרים",
                    "אני נעול בבית, לקחו לי את המפתח",
                    "עבדתי אתמול עד מאוחר אני אגיע טיפה באיחור היום",
                    "יש תאונה, אני כנראה אתעכב",
                    "הרכבת נעצרה. לא ברור עדיין למה, אני מתעכב",
                    "יש לי פגישה עם השיננית",
                    "דרסו לי את הכלב!",
                    "יש לי שלשולים קשים, אני מרותק לבית",
                    "הבייביסטר עושה לי בעיות, אני מחפש מישהוא אחר שישמור לי על הילדים",
                    "הרכב לא מתניע",
                    "אני עובר טיפול שורש",
                     "יש לי שפעת", //check this out
                    "יש לי תור לרופא",
                    "היי, קמתי עם חום היום",
                    "יש אזכרה לסבתא רבא שלי ולגמרי שכחתי מזה",
                    "אני צריך לקחת את אמא שלי לבית חולים",
                    "אני עובר טיפול שורש",
                    "הכלב אכל לי את מערכת ההשקיה ואם אני לא אטפל בזה הגינה תהיה מוצפת",
                    "האוטו לא מניע",
                    "נראה לי שחטפתי איזה וירוס",
                    "יש לי הלוויה של...",
                    "יש לי ברית באותו יום",
                    "יש לי סחרחורת והקאות",
                    "הרמתי את המיטה ונתפס לי הגב"
            };
    //Hebrew - Female
    public static String[] Exuces_work_female =
            {
                    "Exuces_work4",
                    "Exuces_work5"
            };
    //English:
    public static String[] Exuces_work_english =
            {
                    "I may be called in for jury duty",
                    "Exuces_work6",
                    "Exuces_work7"
            };

//##################################################################################################

    //@@@@@@@@@@@@                      Ex:                 @@@@@@@@@@@@@@@@//

    //Hebrew - Male
    public static String[] Exuces_ex =
            {
                    "קיבלתי מכה ביד היא כואבת לי",
                    "אני אעשה את זה מאוחר יותר אני בשוונג של לימודים",
                    "יש לי מיגרנה",
                    "הבטן כואבת לי",
                    "שכחתי מזה לגמרי",
                    "בוא נצא החוצה למסעדה",
                    "היה לי יום ארוך היום",
                    "יש לי עבודה לעשות",
                    "אני הולך לישון, חייב להשלים שעות שינה",
                    "חייב לעזור לחבר במשבר",
                    "אם הייתי אהוב על ידך לא הייתי מתבקש לעשות את זה",
                    "הגרון שלי כואב",
                    "עבדתי קשה מידי בלילה, אני לא מסוגל לעשות כלום",
                    "שכחתי, סליחה. אני אעשה את זה מאוחר מידי. אני יודע שאמרתי את זה אתמול אבל הפעם אני באמת מתכוון לזה",
                    "תכננתי לעשות את זה אחר כך, כרגע אני מפוצץ בעבודה להגיש",
                    "אני חייב להירשם... אין זמן",
                    "המפרק כואב לי",
                    "יש לי סחרחורת והקאות"
            };

    //Hebrew - Female
    public static String[] Exuces_ex_female =
            {
                    "כאבי מחזור",
                    "Exuces_ex5",
                    "Exuces_ex6",
                    "Exuces_ex7",
                    "Exuces_ex8"
            };
    //English:
    public static String[] Exuces_ex_english =
            {
                    "Exuces_ex9",
                    "Exuces_ex10",
                    "Exuces_ex11",
                    "Exuces_ex12"
            };


//##################################################################################################

    //@@@@@@@@@@@@                      Date:                 @@@@@@@@@@@@@@@@//
    public static String[] Exuces_date =
            {
                    "נשברו לי המשקפיים, אני הולך לתקן אותם",
                    "דרסו לי את הכלב!",
                    "תשמעי, אני אהיה איתך כנה. אני לא רואה את זה מתקדם לשום מקום",
                    "אני צריך לקום מוקדם מחר",
                    "שכחתי להאכיל את החתול שלי",
                    "נראלי יש לי הרעלת מזון",
                    "אני לא מוכן למערכת יחסים כרגע",
                    "יש לי שלשול",
                    "צריך לאסוף חבר שהטרמפ שלו הבריז לו מהרכבת",
                    "אני חושב שזה לא יילך בינינו, אני רוצה שנהיה רק חברים",
                    "אני לא רוצה לפגוע בחברות שלנו",
                    "יש לי פוביה מאנשים עם השם שלך",
                    "אני בפיגור בחומר והמבחן שלי מחרותיים",
                    "הבייביסטר שלי הבריזה לי ואני חייב לשמור על הילדים",
                    "נפרדתי לא מזמן מקשר רציני זה עדיין טרי בשבילי לצאת לדייטים",
                    "אני לא חושב שאנחנו מתאימים אחד לשני אבל בהצלחה לך",
                    "יש פה מקרה חירום בעבודה, אני חייב לזוז",
                    "יש לי מיגנרה חזקה עכשיו",
                    "אחותי הקטנה חולה אני צריכה לטפל בה",
                    "האקסית המשוגעת שלי פה, אני חייב לצאת מפה",
                    "הכלב שלי אכל משהוא לא טוב, לוקח אותו דחוף לוטרינר",
                    "אה, לא ידעת שיש לי חברה?",
                    "שיכור מידי כדי להמשיך",
                    "אירוע חירום משפחתי",
                    "החלטתי שאני לא נמשך לנשים יותר",
                    "תשמעי, האקסית שלי חזרה לתמונה ביומיים האחרונים ואני רוצה לתת לזה צ'אנס."
            };
    //Hebrew - Female
    public static String[] Exuces_date_female =
            {
                    "יש לי בחילות, קיבלתי",
                    "Exuces_date6",
                    "Exuces_date7",
                    "Exuces_date8"
            };
    //English:
    public static String[] Exuces_date_english =
            {
                    "Exuces_date10",
                    "Exuces_date11",
                    "Exuces_date12",
                    "Exuces_date13"
            };

//##################################################################################################

    //@@@@@@@@@@@@                      Occassion:                 @@@@@@@@@@@@@@@@//
    public static String[] Exuces_occasion =
            {
                    "יש לי תור לרופא",
                    "היי, קמתי עם חום היום",
                    "אני בטיול",
                    "משהוא דחוף צץ עכשיו ואני לא אוכל לבוא",
                    "יש לי מיגרנה הראש שלי מתפוצץ",
                    "הרכבת מתעכבת, לא אספיק להגיע בזמן",
                    "יש מקרה חירום בעבודה",
                    "יש לי מבחן גמר שאני צריך להתכונן אליו",
                    "אני צריך לקחת את אמא שלי לבית חולים",
                    "הילד חולה, אני נשאר איתו בבית",
                    "לא מרגיש כל כך טוב",
                    "כואבת לי הבטן",
                    "פצעתי את העין כשניסיתי לשים עדשות",
                    "אני עובר טיפול שורש",
                    "יש לי שפעת",
                    "אני אגיד לך את האמת - לא מתחשק לי לצאת היום",
                    "יש לי דייט. לא יכול להגיע, מצטער",
                    "אח שלי חולה ממש ואני צריך לטפל בו",
                    "אני צריך קודם לדבר עם...",
                    "לא ישנתי דקה כל הלילה, לא מסוגל לנהוג",
                    "האוטו לא מניע",
                    "צריך לסיים את הבדיקות",
                    "אשתי חטפה וירוס",
                    "נראה לי שחטפתי איזה וירוס",
                    "בדיוק הזכירו לי על אירוע אחר שיש לי באותו יום",
                    "יש לי חתונה באותו יום",
                    "אני במצב כלכלי על הפנים",
                    "אין לי איך להגיע",
                    "אני בחופשה"
            };
    //Hebrew - Female
    public static String[] Exuces_occasion_female =
            {
                    "Exuces_occasion5",
                    "Exuces_occasion6",
                    "Exuces_occasion7",
                    "Exuces_occasion8"
            };
    //English:
    public static String[] Exuces_occasion_english =
            {
                    "אין לי מה ללבוש",
                    "Exuces_occasion10",
                    "Exuces_occasion11",
                    "Exuces_occasion12",
                    "Exuces_occasion13"
            };
//##################################################################################################

    //@@@@@@@@@@@@                      Homework:                 @@@@@@@@@@@@@@@@//

    public static String[] Exuces_hw =
            {
                    "חשבתי שצריך לעשות רק עד עמוד 21",
                    "שכחתי את המחברת בבית",
                    "לא הבנתי את החומר, אפשר הסבר נוסף בהפסקה?",
                    "אני אגיד לך את האמת - שכחתי מזה",
                    "התקשרתי ל...הוא התבלבל ואמר שאין שיעורים",
                    "התנדבתי בבית אבות",
                    "עשינו יומולדת 70 לסבא שלי",
                    "הייתי חולה",
                    "הייתי אצל רופא",
                    "יש לי 2 מחברות למקצוע והבאתי את הלא נכונה",
                    "המחשב שלי נכבה והעבודה לא נשמרה",
                    "אני חושב שלא הייתי כשחילקת את השיעורי בית",
                    "המחברת שלי אצל מישהוא אחר",
                    "שכחתי את המחברת באוטו של אמא שלי ועכשיו היא במשרד",
                    "המחברת שלי נרטבה",
                    "הספר נשאר לי בתא",
                    "משהוא נדפק לי במחשב, ואני לא מצליח להיכנס לאתר",
            };
    //Hebrew - Female
    public static String[] Exuces_hw_female =
            {
                    "יש לי כאבים בצד",
                    "hw5",
                    "hw6",
                    "hw7",
                    "hw8"
            };
    //English:
    public static String[] Exuces_hw_english =
            {
                    "hw10",
                    "hw11",
                    "hw12",
                    "hw13"
            };
}
